"""
Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
«Hello [введенное имя] [введенная фамилия]! You just delved into Python».
"""

a, b = input(), input()
print(f'Hello {a} {b}! You just delved into Python')
