"""
Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
«Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».
"""

a = input()
print(f'Футбольная команда {a} имеет длину {len(a)} символов')
