"""
Напишите программу, которая определяет наименьшее из четырёх чисел.
"""

print(min(int(input()), int(input()), int(input()), int(input()),))
