"""
Напишите программу, которая определяет, является число четным или нечетным.
"""

if int(input()) % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
