"""
Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.
"""

a, b, c, d, e = int(input()), int(input()), int(input()), int(input()), int(input()),
s = (a, b, c, d, e)
print('Наименьшее число =', min(s))
print('Наибольшее число =', max(s))
