"""
У известного американского писателя Рэя Бредбери есть роман «451 градус по Фарангейту». Напишите программу,
которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.
"""

f = float(input())
print((5 / 9) * (f - 32))
