"""
Дано положительное действительное число. Выведите его дробную часть.
"""

f = float(input())
print(f % int(f))
