"""
На вход программе подаётся четыре целых положительных числа a, b, c и d , каждое на отдельной строке в указанном порядке.
Программа должна вывести значение a**b + c**d
"""

a, b, c, d = int(input()), int(input()), int(input()), int(input())
print(a ** b + c ** d)
