"""
На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n].
"""

n = int(input())
b = list(range(1, n + 1))
print(b)
