"""
На вход программе подается строка текста, состоящая из слов, разделенных ровно одним пробелом.
Напишите программу, которая подсчитывает количество слов в ней.
"""

text = input()
a = text.count(' ')
print(a + 1)
