"""
Напишите программу, которая считывает три строки по очереди,
а затем выводит их в той же последовательности, каждую на отдельной строчке.
"""

print(input())
print(input())
print(input())
