"""
Напишите программу,
которая выводит данную последовательность чисел с одним пробелом между ними.
"""

print(4, 8, 15, 16, 23, 42)
