"""
Напишите программу, которая считывает три строки по очереди,
а затем выводит их в обратной последовательности, каждую на отдельной строчке.
"""

a = str(input())
b = str(input())
c = str(input())
print(c)
print(b)
print(a)
