"""
Напишите программу, которая считает стоимость трех компьютеров,
состоящих из монитора, системного блока, клавиатуры и мыши.
"""

print((int(input()) + int(input()) + int(input()) + int(input())) * 3)
