"""
Напишите программу, в которой вычисляется сумма,
разность и произведение двух целых чисел, введенных с клавиатуры.
"""

num1, num2 = int(input()), int(input())
print(f'{num1} + {num2} =', num1 + num2)
print(f'{num1} - {num2} =', num1 - num2)
print(f'{num1} * {num2} =', num1 * num2)
