"""
Напишите программу вывода на экран трех последовательно идущих чисел,
каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.
"""

n = int(input())
print(n)
print(n + 1)
print(n + 2)
