"""
Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
Каждое число записано в отдельной строке.
"""

print(int(input()) + int(input()) + int(input()))
