"""
Напишите программу, вычисляющую объём куба и площадь его полной поверхности,
по введённому значению длины ребра.
"""

x = int(input())
print('Объем =', x ** 3)
print('Площадь полной поверхности =', 6 * x ** 2)
