"""
Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.
"""

from math import *

x = float(input())
print(pi * x**2)
print(2 * pi * x)
