"""
На вход программе подается одно вещественное число x.
Программа должна вывести одно число – значение указанного выражения.
"""

from math import *
a = float(input())
print(floor(a) + ceil(a))
