"""
На вход программе подается три вещественных числа a != 0, b, c каждое на отдельной строке.
Программа должна вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.
"""

from math import *
a, b, c = float(input()), float(input()), float(input())

d = b**2 - (4 * a * c)
if d < 0:
    print('Нет корней')
elif d == 0:
    print(-b / (2 * a))
elif d > 0:
    x1 = (-b - d ** 0.5) / (2 * a)
    x2 = (-b + d ** 0.5) / (2 * a)
    print(min(x1, x2))
    print(max(x1, x2))
