"""
Напишите программу,
которая выводит на экран текст «I***like***Python» (без кавычек).
"""

a = 'I'
b = 'like'
c = 'Python'
print(a, b, c, sep='***')
