"""
На вход программе подается натуральное число nn.
Напишите программу, которая печатает звездный прямоугольник размерами  n × 19.
"""

x = int(input())
for _ in range(x):
    print('*' * 19)
